/*
   Информационно-вычислительный центр космодрома Байконур
*/

package experement;



/**
 *
 * @author Администратор
 */
public class A {
    
     {
        System.out.println("block 2");
        s=2;
    }
     
    public static int  s =  1;
    
  
    
    {
        System.out.println("block 1");
    }

    
  
        static
    {
          System.out.println("static");
    }
        
    public A() {
        System.out.println("constructor");
    }
  //-------------------Logger---------------------------------------------------
  
  //-------------------Constants------------------------------------------------

  //-------------------Fields---------------------------------------------------

  //-------------------Constructors---------------------------------------------

  //-------------------Getters and setters--------------------------------------

  //-------------------Methods--------------------------------------------------

}